#include <stdio.h>
#include <time.h>

//输出100个小于等于100的随机整数，每行10个，空格隔开

/**
样例输入 无
样例输出 25 62 9 60 13 61 100 5 31 35
        98 11 18 76 90 58 6 31 72 27
        1 62 5 57 51 23 24 21 97 71
        94 3 97 92 38 3 37 52 88 10
        80 82 63 61 68 16 15 94 17 42
        2 82 26 47 59 72 79 80 13 63
        89 62 33 84 79 39 52 7 28 38
        26 40 96 97 24 75 36 50 3 39
        18 60 41 97 48 39 58 100 13 26
        69 99 78 91 55 70 24 9 91 75
**/

int main(){
    int i,m=1;
    srand((unsigned)time(NULL));
    i = rand()%101;
    do{
     printf("%d ",i);
     i = rand()%101;
     if(m%10==0) printf("\n");
     m++;
     }
    while(m<=100);
    return 0;
} 
